Repository: ntoporcov/openclient
Catalog: OpenCodeIOSClient/Localizable.xcstrings
Source language: en
Languages: it, pt_br

source: Automatic sends after silence. Hold to Talk sends when you release the sphere.
it: La modalità Automatico invia dopo il silenzio. Tieni premuto per parlare invia quando rilasci la sfera.
pt_br: O modo Automático envia após o silêncio. Segure para falar envia quando você solta a esfera.

source: Automatically prefers Premium, then Enhanced, then Standard.
it: Preferisce automaticamente Premium, poi Migliorata e infine Standard.
pt_br: Prefere automaticamente Premium, depois Aprimorada e, por fim, Padrão.

source: Available
it: Disponibile
pt_br: Disponível

source: Back
it: Indietro
pt_br: Voltar

source: Balance
it: Saldo
pt_br: Saldo

source: Bar chart
it: Grafico a barre
pt_br: Gráfico de barras

source: Bars
it: Barre
pt_br: Barras

source: Bars widget preview
it: Anteprima del widget Barre
pt_br: Prévia do widget de Barras

source: Base URL
it: URL di base
pt_br: URL base

source: Base URL must start with http:// or https://.
it: L'URL di base deve iniziare con http:// o https://.
pt_br: A URL base deve começar com http:// ou https://.

source: Best Available
it: Migliore disponibile
pt_br: Melhor disponível

source: Best Available automatically uses the highest-quality installed voice for your language.
it: Migliore disponibile usa automaticamente la voce installata di qualità più alta per la tua lingua.
pt_br: Melhor disponível usa automaticamente a voz instalada de maior qualidade para seu idioma.

source: BEST VALUE
it: MIGLIOR VALORE
pt_br: MELHOR OFERTA

source: Binary File
it: File binario
pt_br: Arquivo binário

source: Blocked unexpected navigation response
it: Risposta di navigazione inattesa bloccata
pt_br: Resposta de navegação inesperada bloqueada

source: Blocked unexpected navigation to %@
it: Navigazione inattesa verso %@ bloccata
pt_br: Navegação inesperada bloqueada para %@

source: Booping
it: Boopando
pt_br: Fazendo boop

source: Bring your language next
it: La tua lingua potrebbe essere la prossima
pt_br: Seu idioma pode ser o próximo

source: Browse beside your chat
it: Naviga accanto alla chat
pt_br: Navegue ao lado do chat

source: Browse Downloaded Chats
it: Sfoglia le chat scaricate
pt_br: Ver chats baixados

source: Browser ready
it: Browser pronto
pt_br: Navegador pronto

source: Browsing downloaded chats
it: Sfoglia chat scaricate
pt_br: Navegando por chats baixados

source: Bug Found
it: Bug trovato
pt_br: Bug encontrado

source: Bug found medal
it: Medaglia bug trovato
pt_br: Medalha de bug encontrado

source: Build for simulator
it: Compila per il simulatore
pt_br: Build para simulador

source: Built In The Open
it: Costruito in modo aperto
pt_br: Desenvolvido de forma aberta

source: Buying Pro Lifetime does not cancel Pro Monthly. Cancel Pro Monthly to avoid future renewals.
it: L'acquisto di Pro a vita non annulla Pro mensile. Annulla Pro mensile per evitare rinnovi futuri.
pt_br: Comprar o Pro Vitalício não cancela o Pro Mensal. Cancele o Pro Mensal para evitar futuras renovações.

source: Cache Tokens
it: Token cache
pt_br: Tokens de cache

source: Call ID
it: ID chiamata
pt_br: ID de chamada

source: Cancel
it: Annulla
pt_br: Cancelar

source: Cancel Authorization
it: Annulla autorizzazione
pt_br: Cancelar autorização

source: Cancel Request
it: Annulla richiesta
pt_br: Cancelar solicitação

source: Card Style
it: Stile card
pt_br: Estilo de cartão

source: Cards
it: Card
pt_br: Cartões

source: Cards that fit your flow
it: Card adatte al tuo flusso
pt_br: Cartões que se adaptam ao seu fluxo

source: Category
it: Categoria
pt_br: Categoria

source: Cerebrating
it: Cerebrando
pt_br: Cerebrando

source: Changes
it: Modifiche
pt_br: Alterações

source: Charts, safe previews, images, and video render natively inside your conversation.
it: Grafici, anteprime sicure, immagini e video vengono renderizzati nativamente nella tua conversazione.
pt_br: Gráficos, prévias seguras, imagens e vídeos são renderizados nativamente em sua conversa.

source: Chat activity shimmer
it: Effetto shimmer attività chat
pt_br: Brilho da atividade de chat

source: Chat Appearance
it: Aspetto chat
pt_br: Aparência do chat

source: Chat Breadcrumbs
it: Breadcrumb chat
pt_br: Navegação do chat

source: Chat title
it: Titolo chat
pt_br: Título do chat

source: Chats
it: Chat

source: Chats stay centered in a narrower column, making long conversations easier to scan on a large display.
it: Le chat restano centrate in una colonna più stretta, così le conversazioni lunghe sono più facili da scorrere su uno schermo grande.
pt_br: Os chats permanecem centralizados em uma coluna mais estreita, facilitando acompanhar conversas longas em uma tela grande.

source: Check Project Requests
it: Controlla le richieste del progetto
pt_br: Verificar solicitações do projeto

source: Check status
it: Verifica stato
pt_br: Verificar status

source: Check Status
it: Verifica stato
pt_br: Verificar status

source: Check the value for %@.
it: Verifica il valore di %@.
pt_br: Verifique o valor de %@.

source: Checking result
it: Verifica del risultato
pt_br: Verificando resultado

source: Checking Result
it: Verifica del risultato
pt_br: Verificando resultado

source: Checking server
it: Verifica del server
pt_br: Verificando servidor

source: Checking status does not resend this submission.
it: La verifica dello stato non invia di nuovo questo messaggio.
pt_br: Verificar o status não reenvia esta mensagem.

source: Child session
it: Sessione figlia
pt_br: Sessão filha

source: Choose a new icon and decide whether chat activity gets a subtle shimmer.
it: Scegli una nuova icona e decidi se l'attività della chat deve avere un effetto shimmer sottile.
pt_br: Escolha um novo ícone e decida se a atividade do chat terá um brilho sutil.

source: Choose a terminal session from the list.
it: Scegli una sessione del terminale dall'elenco.
pt_br: Escolha uma sessão de terminal na lista.

source: Choose a trusted saved server and OpenClient can reconnect when you open the app.
it: Scegli un server salvato attendibile e OpenClient si riconnetterà quando apri l'app.
pt_br: Escolha um servidor salvo confiável e o OpenClient poderá se reconectar quando você abrir o aplicativo.

source: Choose an absolute destination parent directory on the server.
it: Scegli un percorso assoluto sul server per la cartella padre di destinazione.
pt_br: Escolha um caminho absoluto no servidor para o diretório pai de destino.

source: Choose an absolute path on the server. New worktrees are created inside this directory.
it: Scegli un percorso assoluto sul server. I nuovi worktree vengono creati all'interno di questa cartella.
pt_br: Escolha um caminho absoluto no servidor. Novos worktrees são criados dentro deste diretório.

source: Choose an explicit agent before retrying this shared chat.
it: Scegli esplicitamente un agente prima di riprovare questa chat condivisa.
pt_br: Escolha um agente explicitamente antes de tentar novamente este chat compartilhado.

source: Choose an explicit model before retrying this shared chat.
it: Scegli esplicitamente un modello prima di riprovare questa chat condivisa.
pt_br: Escolha um modelo explicitamente antes de tentar novamente este chat compartilhado.

source: Choose Command
it: Scegli comando
pt_br: Escolha o comando

source: Choose Compact, Default, or Activity cards for each project’s session list, with optional last-user-message context.
it: Scegli card Compatte, Predefinite o Attività per l'elenco sessioni di ogni progetto, con contesto opzionale dell'ultimo messaggio utente.
pt_br: Escolha cartões Compactos, Padrão ou Atividade para a lista de sessões de cada projeto, com contexto opcional de última mensagem do usuário.

source: Choose how this OpenCode server should authenticate with %@.
it: Scegli come questo server OpenCode deve autenticarsi con %@.
pt_br: Escolha como este servidor OpenCode deve ser autenticado com %@.

source: Choose how you write and keep an eye on provider usage, in the app and on your Home Screen.
it: Scegli come scrivere e tieni sotto controllo l'utilizzo dei provider, nell'app e sulla schermata Home.
pt_br: Escolha como escrever e acompanhe o uso dos provedores, no app e na Tela de Início.

source: Choose the composer layout for iPhone. iPad always uses Assistant.
it: Scegli il layout del compositore per iPhone. iPad usa sempre lo stile Assistente.
pt_br: Escolha o layout do compositor para iPhone. O iPad sempre usa o estilo Assistente.

source: Choose the language for the buggy snippet. These match the app's syntax highlighting support.
it: Scegli il linguaggio per lo snippet con il bug. Corrispondono al supporto di evidenziazione della sintassi dell'app.
pt_br: Escolha o idioma para o snippet com erros. Eles correspondem ao suporte de realce de sintaxe do aplicativo.

source: Choose the model that will generate the buggy code and judge your answer.
it: Scegli il modello che genererà il codice con il bug e valuterà la tua risposta.
pt_br: Escolha o modelo que vai gerar o código com bug e avaliar sua resposta.

source: Choose the model that will host the game. OpenClient will start a new chat and send the private game setup automatically.
it: Scegli il modello che ospiterà il gioco. OpenClient avvierà una nuova chat e invierà automaticamente la configurazione privata del gioco.
pt_br: Escolha o modelo que hospedará o jogo. OpenClient iniciará um novo chat e enviará a configuração do jogo privado automaticamente.

source: Choose your composer
it: Scegli il tuo compositore
pt_br: Escolha seu compositor

source: City
it: Città
pt_br: Cidade

# City: %@, %@
source: City: %1$@, %2$@
it: Città: %1$@, %2$@
pt_br: Cidade: %1$@, %2$@

source: Clear
it: Cancella
pt_br: Limpar

source: Clear chat search
it: Cancella ricerca chat
pt_br: Limpar pesquisa de chat

source: Clear Current Tab
it: Cancella scheda corrente
pt_br: Limpar guia atual

source: Clear Image
it: Rimuovi immagine
pt_br: Limpar imagem

source: Client ID
it: ID client
pt_br: ID do cliente

source: Clone OpenClient and help me translate it into [YOUR LANGUAGE]...
it: Clona OpenClient e aiutami a tradurlo in [LA TUA LINGUA]...
pt_br: Clone o OpenClient e me ajude a traduzi-lo para [SEU IDIOMA]...

source: Close
it: Chiudi
pt_br: Fechar

source: Close browser
it: Chiudi browser
pt_br: Fechar navegador

source: Close subagent thread
it: Chiudi thread del subagente
pt_br: Fechar thread do subagente

source: Close Terminal
it: Chiudi terminale
pt_br: Fechar terminal

source: Clue: %@
it: Indizio: %@
pt_br: Pista: %@

source: Code
it: Codice
pt_br: Código

source: Code expires at %@
it: Il codice scade alle %@
pt_br: O código expira às %@

source: Code Search
it: Ricerca nel codice
pt_br: Pesquisa de código

source: Cogitating
it: Cogitando
pt_br: Cogitação

source: Collapse browser
it: Comprimi browser
pt_br: Recolher navegador

source: Comfortable reading width
it: Una larghezza comoda per leggere
pt_br: Largura confortável para leitura

source: Command
it: Comando
pt_br: Comando

source: Command authentication is not supported in OpenClient. Complete it on the server.
it: L'autenticazione tramite comando non è supportata in OpenClient. Completala sul server.
pt_br: A autenticação por comando não é compatível com o OpenClient. Conclua-a no servidor.

source: Command is no longer available. Open the app to sync widget settings.
it: Il comando non è più disponibile. Apri l'app per sincronizzare le impostazioni del widget.
pt_br: O comando não está mais disponível. Abra o app para sincronizar as configurações do widget.

source: Command unavailable
it: Comando non disponibile
pt_br: Comando indisponível

source: Commands
it: Comandi
pt_br: Comandos

source: Compact
it: Compatta
pt_br: Compacto

source: Compact is only available in root sessions.
it: La compattazione è disponibile solo nelle sessioni principali.
pt_br: A compactação só está disponível em sessões raiz.

source: Compact Session
it: Compatta sessione
pt_br: Compactar sessão

source: Compacted Context
it: Contesto compattato
pt_br: Contexto compactado

source: Compacting session
it: Compattazione della sessione
pt_br: Compactando sessão

source: Complete OAuth
it: Completa OAuth
pt_br: Concluir OAuth

source: Completed
it: Completato
pt_br: Concluído

source: Completed at %@
it: Completato alle %@
pt_br: Concluído às %@

source: Composer Style
it: Stile del compositore
pt_br: Estilo do compositor

source: Computing
it: Elaborando
pt_br: Computando

source: Concocting
it: Preparando
pt_br: Inventando

source: Config
it: Configurazione
pt_br: Configuração

source: Connection Settings
it: Impostazioni della connessione
pt_br: Configurações da conexão

source: Configurations
it: Configurazioni
pt_br: Configurações

source: Configure commands as quick Actions. Sessions stay on the server. Successful runs are hidden locally and can be restored from Action Run History.
it: Configura i comandi come azioni rapide. Le sessioni restano sul server. Le esecuzioni riuscite vengono nascoste localmente e possono essere ripristinate dalla Cronologia delle esecuzioni delle azioni.
pt_br: Configure comandos como ações rápidas. As sessões permanecem no servidor. Execuções bem-sucedidas ficam ocultas localmente e podem ser restauradas pelo Histórico de execução de ações.

source: Configure the OC Notify HTTPS public origin on the OpenCode host, then reconnect.
it: Configura l'origine pubblica HTTPS di OC Notify sull'host OpenCode, quindi riconnettiti.
pt_br: Configure a origem pública HTTPS do OC Notify no host do OpenCode e reconecte-se.

source: Configure these environment variables on the machine running OpenCode.
it: Configura queste variabili d'ambiente sulla macchina che esegue OpenCode.
pt_br: Configure estas variáveis de ambiente na máquina que executa o OpenCode.

source: Conjuring
it: Evocando
pt_br: Conjurando

source: Connect %@ with an API key stored by the OpenCode server.
it: Connetti %@ con una chiave API memorizzata dal server OpenCode.
pt_br: Conecte %@ usando uma chave de API armazenada pelo servidor OpenCode.

source: Connect on launch
it: Connetti all'avvio
pt_br: Conectar ao iniciar

source: Connect Provider
it: Connetti provider
pt_br: Conectar provedor

source: Connect to an OpenCode server before starting a chat.
it: Connettiti a un server OpenCode prima di avviare una chat.
pt_br: Conecte-se a um servidor OpenCode antes de iniciar um chat.

source: Connect to an OpenCode server to discover provider credentials.
it: Connettiti a un server OpenCode per rilevare le credenziali dei provider.
pt_br: Conecte-se a um servidor OpenCode para descobrir credenciais de provedores.

source: Connect to OpenCode
it: Connetti a OpenCode
pt_br: Conectar ao OpenCode

source: Connect to OpenCode v2 and explore early support as it evolves. Some features may still be incomplete or change along the way.
it: Connettiti a OpenCode v2 e prova in anteprima il supporto mentre continua a evolversi. Alcune funzionalità potrebbero essere ancora incomplete o cambiare nel tempo.
pt_br: Conecte-se ao OpenCode v2 e experimente o suporte antecipado enquanto ele evolui. Alguns recursos ainda podem estar incompletos ou mudar ao longo do tempo.

source: Connect to the OpenClient plugin before playing this video.
it: Connettiti al plugin OpenClient prima di riprodurre questo video.
pt_br: Conecte-se ao plugin OpenClient antes de reproduzir este vídeo.

source: Connect to the OpenClient plugin before viewing this image.
it: Connettiti al plugin OpenClient prima di visualizzare questa immagine.
pt_br: Conecte-se ao plugin OpenClient antes de visualizar esta imagem.

source: Connected
it: Connesso
pt_br: Conectado

source: Connecting
it: Connessione in corso
pt_br: Conectando

source: Connecting video bridge...
it: Connessione al bridge video...
pt_br: Conectando ponte de vídeo...

source: Connecting...
it: Connessione in corso...
pt_br: Conectando...

source: Connection
it: Connessione
pt_br: Conexão

source: Connection attempt in progress
it: Tentativo di connessione in corso
pt_br: Tentativa de conexão em andamento

source: Connection Failed
it: Connessione non riuscita
pt_br: Falha na conexão

source: Contemplating
it: Contemplando
pt_br: Contemplando

source: Content rule store is unavailable
it: L'archivio delle regole di contenuto non è disponibile
pt_br: O armazenamento de regras de conteúdo não está disponível

source: Content rules did not compile
it: Le regole di contenuto non sono state compilate
pt_br: As regras de conteúdo não foram compiladas

source: Context
it: Contesto
pt_br: Contexto

source: Context Limit
it: Limite di contesto
pt_br: Limite de contexto

source: Context usage appears after the model returns token metrics for this chat.
it: L'utilizzo del contesto appare dopo che il modello restituisce le metriche dei token per questa chat.
pt_br: O uso do contexto aparece depois que o modelo retorna métricas de token para este chat.

source: Continue
it: Continua
pt_br: Continuar

source: Continue in Browser
it: Continua nel browser
pt_br: Continuar no Navegador

source: Control Center
it: Centro di Controllo
pt_br: Central de Controle

source: Controls which models appear in model pickers on this device, matching the upstream web UI preference behavior.
it: Controlla quali modelli compaiono nei selettori di modello su questo dispositivo, replicando il comportamento delle preferenze della web UI originale.
pt_br: Controla quais modelos aparecem nos seletores deste dispositivo, de acordo com o comportamento das preferências da interface web upstream.

source: Conversation paused
it: Conversazione in pausa
pt_br: Conversa pausada

source: Conversation Voice
it: Voce della conversazione
pt_br: Voz da conversa

source: cooler high-latitude region
it: regione più fredda ad alta latitudine
pt_br: região mais fria de alta latitude

# Coordinates: %lf, %lf
source: Coordinates: %1$lf, %2$lf
it: Coordinate: %1$lf, %2$lf
pt_br: Coordenadas: %1$lf, %2$lf

source: Copied
it: Copiato
pt_br: Copiado

source: Copied Transcript
it: Trascrizione copiata
pt_br: Transcrição copiada

source: Copy
it: Copia
pt_br: Copiar

source: Copy a ready-to-use prompt for your AI to translate OpenClient and open a pull request.
it: Copia un prompt pronto all'uso per chiedere alla tua IA di tradurre OpenClient e aprire una pull request.
pt_br: Copie um prompt pronto para usar e peça à sua IA para traduzir o OpenClient e abrir um pull request.

source: Copy as Markdown
it: Copia come Markdown
pt_br: Copiar como Markdown

source: Copy Filtered
it: Copia filtrati
pt_br: Copiar filtrados

source: Copy Message
it: Copia messaggio
pt_br: Copiar mensagem

source: Copy Setup & Open Guide
it: Copia configurazione e apri guida
pt_br: Copiar configuração e abrir guia

source: Copy Transcript
it: Copia trascrizione
pt_br: Copiar transcrição

source: Copy translation prompt
it: Copia il prompt per la traduzione
pt_br: Copiar prompt de tradução

source: Couldn't Change App Icon
it: Impossibile cambiare l'icona dell'app
pt_br: Não foi possível alterar o ícone do app

source: Crafting
it: Realizzando
pt_br: Criando

source: Create a new session from a previous message
it: Crea una nuova sessione da un messaggio precedente
pt_br: Crie uma nova sessão a partir de uma mensagem anterior

source: Create a Personal Voice in Settings > Accessibility > Personal Voice, then allow OpenClient to use it here.
it: Crea una Voce personale in Impostazioni > Accessibilità > Voce personale, quindi consenti a OpenClient di usarla qui.
pt_br: Crie uma Voz Pessoal em Ajustes > Acessibilidade > Voz Pessoal e permita que o OpenClient a use aqui.

source: Create a session to start chatting.
it: Crea una sessione per iniziare a chattare.
pt_br: Crie uma sessão para começar a conversar.

source: Create new worktree
it: Crea nuovo worktree
pt_br: Criar novo worktree

source: Create Project
it: Crea progetto
pt_br: Criar projeto

source: Create Session
it: Crea sessione
pt_br: Criar sessão

source: Create sessions or run saved slash commands straight from widgets and Control Center.
it: Crea sessioni o esegui comandi slash salvati direttamente da widget e Centro di Controllo.
pt_br: Crie sessões ou execute comandos de barra salvos diretamente de widgets e da Central de Controle.

source: Create Unlimited Sessions
it: Crea sessioni illimitate
pt_br: Criar sessões ilimitadas

source: Create Workspace
it: Crea workspace
pt_br: Criar espaço de trabalho

source: Creates a new OpenClient session and sends the first message.
it: Crea una nuova sessione OpenClient e invia il primo messaggio.
pt_br: Cria uma nova sessão OpenClient e envia a primeira mensagem.

source: Creates a new OpenClient session in a selected project.
it: Crea una nuova sessione OpenClient in un progetto selezionato.
pt_br: Cria uma nova sessão OpenClient em um projeto selecionado.

source: Creating
it: Creazione in corso
pt_br: Criando

source: Creating session
it: Creazione sessione
pt_br: Criando sessão

source: Creating Session
it: Creazione della sessione
pt_br: Criando sessão

source: Creating worktree
it: Creazione worktree
pt_br: Criando worktree

source: Creating Worktree...
it: Creazione worktree...
pt_br: Criando worktree...

source: Creating...
it: Creazione in corso...
pt_br: Criando...

source: Credential access is not verified for this source.
it: L'accesso alle credenziali non è verificato per questa origine.
pt_br: O acesso à credencial não foi verificado para esta origem.

source: Credential expired
it: Credenziale scaduta
pt_br: Credencial expirada

source: Credential import is not available for this server version.
it: L'importazione delle credenziali non è disponibile per questa versione del server.
pt_br: A importação de credenciais não está disponível para esta versão do servidor.

source: Credential read failed
it: Lettura della credenziale non riuscita
pt_br: Falha ao ler a credencial

source: Credential read failed (%@)
it: Lettura della credenziale non riuscita (%@)
pt_br: Falha ao ler a credencial (%@)

source: Credential reading requires secure transport.
it: La lettura della credenziale richiede un trasporto sicuro.
pt_br: A leitura da credencial requer transporte seguro.

source: Credential rejected
it: Credenziale rifiutata
pt_br: Credencial rejeitada

source: Credential unavailable
it: Credenziale non disponibile
pt_br: Credencial indisponível

source: Credentials
it: Credenziali
pt_br: Credenciais

source: Credentials are stored on the OpenCode server, not on this device.
it: Le credenziali vengono memorizzate sul server OpenCode, non su questo dispositivo.
pt_br: As credenciais são armazenadas no servidor OpenCode, não neste dispositivo.

source: Credentials stay in Keychain. OpenClient never displays their values.
it: Le credenziali restano nel Portachiavi. OpenClient non ne mostra mai i valori.
pt_br: As credenciais ficam nas Chaves. O OpenClient nunca exibe seus valores.

source: Crumbs
it: Breadcrumb
pt_br: Rastros

source: Crunching
it: Elaborando
pt_br: Processando

source: Current
it: Corrente
pt_br: Atual

source: Custom
it: Personalizzato
pt_br: Personalizado

source: Custom header keys must be unique.
it: Le chiavi delle intestazioni personalizzate devono essere univoche.
pt_br: As chaves de cabeçalho personalizadas devem ser exclusivas.

source: Custom model IDs must be unique.
it: Gli ID dei modelli personalizzati devono essere univoci.
pt_br: Os IDs de modelos personalizados devem ser exclusivos.

source: Custom Provider
it: Provider personalizzato
pt_br: Provedor personalizado

source: Custom provider configuration is unavailable on this v2 server. Configure it on the server instead.
it: La configurazione dei provider personalizzati non è disponibile su questo server v2. Configurali direttamente sul server.
pt_br: A configuração de provedores personalizados não está disponível neste servidor v2. Configure-os diretamente no servidor.
